In [1]:
# elements acessing row/column
# loc and iloc-->locatio0n and index location based

In [7]:
import pandas as pd
df=pd.DataFrame({"name":['mammu','varshi','mokshi'],"rollNo":[555,510,505],"branch":['cse','ece','civil']},index=[1,2,3])

In [8]:
df

     name  rollNo branch
1   mammu     555    cse
2  varshi     510    ece
3  mokshi     505  civil

In [10]:
df.loc[1]

name      mammu
rollNo      555
branch      cse
Name: 1, dtype: object

In [11]:
df.loc[2]['rollNo']

510

In [13]:
df.iloc[0]

name      mammu
rollNo      555
branch      cse
Name: 1, dtype: object

In [14]:
df.iloc[2]["branch"]

'civil'

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 3 columns):
name      3 non-null object
rollNo    3 non-null int64
branch    3 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [16]:
df.describe()

           rollNo
count    3.000000
mean   523.333333
std     27.537853
min    505.000000
25%    507.500000
50%    510.000000
75%    532.500000
max    555.000000

In [17]:
df.count()

name      3
rollNo    3
branch    3
dtype: int64

In [18]:
df.dtypes

name      object
rollNo     int64
branch    object
dtype: object

In [19]:
df.count(axis=1)

1    3
2    3
3    3
dtype: int64

In [20]:
df.count(axis=0)

name      3
rollNo    3
branch    3
dtype: int64

In [21]:
df

     name  rollNo branch
1   mammu     555    cse
2  varshi     510    ece
3  mokshi     505  civil

In [25]:
df.count(axis='rows')

name      3
rollNo    3
branch    3
dtype: int64

In [27]:
df.set_index(["rollNo","branch"])

                 name
rollNo branch
555    cse      mammu
510    ece     varshi
505    civil   mokshi

In [28]:
df.set_index(["name"])

        rollNo branch
name
mammu      555    cse
varshi     510    ece
mokshi     505  civil

In [31]:
frame=pd.Series([9,3,5,6,21,"name"])
frame

0       9
1       3
2       5
3       6
4      21
5    name
dtype: object

In [32]:
frame.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [33]:
frame.describe()

count     6
unique    6
top       6
freq      1
dtype: int64

In [34]:
frame.count()

6

In [39]:
import numpy as np
x=np.arange(10)
x

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

x.rshape()

In [42]:
x.reshape(2,5)

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [43]:
data=pd.DataFrame(np.arange(12).reshape(4,3),columns=['a','b','c'])
data

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [45]:
data=pd.DataFrame(np.arange(20).reshape(4,5),columns=['a','b','c','d','e'])
data

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [48]:
data.loc[1,'b']=np.nan
data

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [49]:
data.isnull().sum()

a    0
b    1
c    0
d    0
e    0
dtype: int64

In [50]:
df+data

    a   b branch   c   d   e name  rollNo
0 NaN NaN    NaN NaN NaN NaN  NaN     NaN
1 NaN NaN    NaN NaN NaN NaN  NaN     NaN
2 NaN NaN    NaN NaN NaN NaN  NaN     NaN
3 NaN NaN    NaN NaN NaN NaN  NaN     NaN

In [51]:
df.add(data)

    a   b branch   c   d   e name  rollNo
0 NaN NaN    NaN NaN NaN NaN  NaN     NaN
1 NaN NaN    NaN NaN NaN NaN  NaN     NaN
2 NaN NaN    NaN NaN NaN NaN  NaN     NaN
3 NaN NaN    NaN NaN NaN NaN  NaN     NaN

In [54]:
dd=df.fill_values=1

In [55]:
dd

1